#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
module.cosmos.azurerm_cosmosdb_account.wallet_02: Preparing import... [id=/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-02]
module.cdn.azurerm_storage_account_static_website.cdn_website: Preparing import... [id=/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletcdnst01]
module.function_apps.module.function_app_user_autoscaler_02.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_apps.module.function_app_support_autoscaler.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.cdn.azurerm_storage_account.this will be updated in-place
  ~ resource "azurerm_storage_account" "this" {
      ~ cross_tenant_replication_enabled   = true -> false
        id                                 = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletcdnst01"
        name                               = "iopitnwalletcdnst01"
        tags                               = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (95 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.cdn.azurerm_storage_account_static_website.cdn_website will be imported
    resource "azurerm_storage_account_static_website" "cdn_website" {
        error_404_document = "404.html"
        id                 = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletcdnst01"
        index_document     = "index.html"
        storage_account_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletcdnst01"
    }

  # module.cdn.azurerm_storage_container.exchange must be replaced
-/+ resource "azurerm_storage_container" "exchange" {
      ~ default_encryption_scope          = "$account-encryption-key" -> (known after apply)
      ~ has_immutability_policy           = false -> (known after apply)
      ~ has_legal_hold                    = false -> (known after apply)
      ~ id                                = "https://iopitnwalletcdnst01.blob.core.windows.net/exchange" -> (known after apply)
      ~ metadata                          = {} -> (known after apply)
        name                              = "exchange"
      ~ resource_manager_id               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletcdnst01/blobServices/default/containers/exchange" -> (known after apply)
      + storage_account_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletcdnst01" # forces replacement
      - storage_account_name              = "iopitnwalletcdnst01" -> null # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.cdn.azurerm_storage_container.hub-spid-login must be replaced
-/+ resource "azurerm_storage_container" "hub-spid-login" {
      ~ default_encryption_scope          = "$account-encryption-key" -> (known after apply)
      ~ has_immutability_policy           = false -> (known after apply)
      ~ has_legal_hold                    = false -> (known after apply)
      ~ id                                = "https://iopitnwalletcdnst01.blob.core.windows.net/hub-spid-login" -> (known after apply)
      ~ metadata                          = {} -> (known after apply)
        name                              = "hub-spid-login"
      ~ resource_manager_id               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletcdnst01/blobServices/default/containers/hub-spid-login" -> (known after apply)
      + storage_account_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletcdnst01" # forces replacement
      - storage_account_name              = "iopitnwalletcdnst01" -> null # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.cdn.azurerm_storage_container.pdnd must be replaced
-/+ resource "azurerm_storage_container" "pdnd" {
      ~ default_encryption_scope          = "$account-encryption-key" -> (known after apply)
      ~ has_immutability_policy           = false -> (known after apply)
      ~ has_legal_hold                    = false -> (known after apply)
      ~ id                                = "https://iopitnwalletcdnst01.blob.core.windows.net/pdnd" -> (known after apply)
      ~ metadata                          = {} -> (known after apply)
        name                              = "pdnd"
      ~ resource_manager_id               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletcdnst01/blobServices/default/containers/pdnd" -> (known after apply)
      + storage_account_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletcdnst01" # forces replacement
      - storage_account_name              = "iopitnwalletcdnst01" -> null # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.cdn.azurerm_storage_container.well_known must be replaced
-/+ resource "azurerm_storage_container" "well_known" {
      ~ default_encryption_scope          = "$account-encryption-key" -> (known after apply)
      ~ has_immutability_policy           = false -> (known after apply)
      ~ has_legal_hold                    = false -> (known after apply)
      ~ id                                = "https://iopitnwalletcdnst01.blob.core.windows.net/well-known" -> (known after apply)
      ~ metadata                          = {} -> (known after apply)
        name                              = "well-known"
      ~ resource_manager_id               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletcdnst01/blobServices/default/containers/well-known" -> (known after apply)
      + storage_account_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletcdnst01" # forces replacement
      - storage_account_name              = "iopitnwalletcdnst01" -> null # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.cosmos.azurerm_cosmosdb_account.wallet_02 will be imported
    resource "azurerm_cosmosdb_account" "wallet_02" {
        access_key_metadata_writes_enabled       = true
        analytical_storage_enabled               = false
        automatic_failover_enabled               = true
        burst_capacity_enabled                   = false
        create_mode                              = "Default"
        default_identity_type                    = "UserAssignedIdentity=/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.ManagedIdentity/userAssignedIdentities/io-p-itn-wallet-psn-id-01&FederatedClientId=51926a72-8ab4-4b1a-90a6-0c0e6ee834e9"
        endpoint                                 = "https://io-p-itn-wallet-cosno-02.documents.azure.com:443/"
        free_tier_enabled                        = false
        id                                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-02"
        ip_range_filter                          = []
        is_virtual_network_filter_enabled        = false
        kind                                     = "GlobalDocumentDB"
        local_authentication_disabled            = false
        location                                 = "italynorth"
        managed_hsm_key_id                       = "https://pagopa-managedhsm.managedhsm.azure.net/keys/mdb001prod"
        minimal_tls_version                      = "Tls12"
        multiple_write_locations_enabled         = false
        name                                     = "io-p-itn-wallet-cosno-02"
        network_acl_bypass_for_azure_services    = false
        network_acl_bypass_ids                   = []
        offer_type                               = "Standard"
        partition_merge_enabled                  = false
        primary_key                              = (sensitive value)
        primary_readonly_key                     = (sensitive value)
        primary_readonly_sql_connection_string   = (sensitive value)
        primary_sql_connection_string            = (sensitive value)
        public_network_access_enabled            = false
        read_endpoints                           = [
            "https://io-p-itn-wallet-cosno-02-italynorth.documents.azure.com:443/",
            "https://io-p-itn-wallet-cosno-02-spaincentral.documents.azure.com:443/",
        ]
        resource_group_name                      = "io-p-itn-wallet-rg-01"
        secondary_key                            = (sensitive value)
        secondary_readonly_key                   = (sensitive value)
        secondary_readonly_sql_connection_string = (sensitive value)
        secondary_sql_connection_string          = (sensitive value)
        tags                                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        write_endpoints                          = [
            "https://io-p-itn-wallet-cosno-02-italynorth.documents.azure.com:443/",
        ]

        analytical_storage {
            schema_type = "WellDefined"
        }

        backup {
            interval_in_minutes = 0
            retention_in_hours  = 0
            storage_redundancy  = null
            tier                = "Continuous30Days"
            type                = "Continuous"
        }

        consistency_policy {
            consistency_level       = "Session"
            max_interval_in_seconds = 5
            max_staleness_prefix    = 100
        }

        geo_location {
            failover_priority = 0
            id                = "io-p-itn-wallet-cosno-02-italynorth"
            location          = "italynorth"
            zone_redundant    = true
        }
        geo_location {
            failover_priority = 1
            id                = "io-p-itn-wallet-cosno-02-spaincentral"
            location          = "spaincentral"
            zone_redundant    = false
        }

        identity {
            identity_ids = [
                "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.ManagedIdentity/userAssignedIdentities/io-p-itn-wallet-psn-id-01",
            ]
            principal_id = null
            tenant_id    = null
            type         = "UserAssigned"
        }
    }

  # module.cosmos.azurerm_cosmosdb_sql_container.containers_01["wallet-instances"] will be updated in-place
  ~ resource "azurerm_cosmosdb_sql_container" "containers_01" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-01/sqlDatabases/db/containers/wallet-instances"
        name                = "wallet-instances"
        # (6 unchanged attributes hidden)

      ~ autoscale_settings {
          ~ max_throughput = 4000 -> 8000
        }

        # (2 unchanged blocks hidden)
    }

  # module.cosmos.azurerm_cosmosdb_sql_container.containers_02["wallet-instances"] will be updated in-place
  ~ resource "azurerm_cosmosdb_sql_container" "containers_02" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-02/sqlDatabases/db/containers/wallet-instances"
        name                = "wallet-instances"
        # (6 unchanged attributes hidden)

      ~ autoscale_settings {
          ~ max_throughput = 4000 -> 8000
        }

        # (2 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_support.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/io-p-itn-wallet-supp-func-01"
        name                                           = "io-p-itn-wallet-supp-func-01"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Wallet"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (32 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_support.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/io-p-itn-wallet-supp-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Wallet"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (30 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_support.azurerm_storage_account.this will be updated in-place
  ~ resource "azurerm_storage_account" "this" {
      ~ cross_tenant_replication_enabled   = true -> false
        id                                 = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletsuppstfn01"
        name                               = "iopitnwalletsuppstfn01"
        tags                               = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (95 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_support.azurerm_subnet.this will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-wallet-supp-func-snet-01"
        name                                          = "io-p-itn-wallet-supp-func-snet-01"
      ~ private_endpoint_network_policies             = "Enabled" -> "Disabled"
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.function_apps.module.function_app_user_02.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/io-p-itn-wallet-user-func-02"
        name                                           = "io-p-itn-wallet-user-func-02"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Wallet"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (32 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_user_02.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/io-p-itn-wallet-user-func-02/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (30 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_eviction_time_in_min             = 0 -> 2
            # (33 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.function_apps.module.function_app_user_02.azurerm_storage_account.this will be updated in-place
  ~ resource "azurerm_storage_account" "this" {
      ~ cross_tenant_replication_enabled   = true -> false
        id                                 = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletuserstfn02"
        name                               = "iopitnwalletuserstfn02"
        tags                               = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (95 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_user_02.azurerm_subnet.this will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-wallet-user-func-snet-02"
        name                                          = "io-p-itn-wallet-user-func-snet-02"
      ~ private_endpoint_network_policies             = "Enabled" -> "Disabled"
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.storage_accounts.module.storage_account.azurerm_storage_account.this will be updated in-place
  ~ resource "azurerm_storage_account" "this" {
      ~ cross_tenant_replication_enabled   = true -> false
        id                                 = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01"
        name                               = "iopitnwalletst01"
        tags                               = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (95 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 2 to import, 4 to add, 12 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
